AnnsAnns/RIOT/cpu/rp2350_riscv/cpu.c
/*
 * SPDX-FileCopyrightText: 2025 Tom Hert <git@annsann.eu>
 * SPDX-FileCopyrightText: 2025 HAW Hamburg
 * SPDX-License-Identifier: LGPL-2.1-only
 */

/**
 * @ingroup         cpu_rp2350
 * @{
 *
 * @file
 * @brief           CPU initialization implementation for the RP2350
 *
 * @author          Tom Hert <git@annsann.eu>
 */

#include "cpu.h"

#include "RP2350.h"
#include "board.h"
#include "clock_conf.h"
#include "cpu_conf_common.h"
#include "helpers.h"
#include "kernel_init.h"
#include "periph/gpio.h"
#include "periph/init.h"
#include "periph_cpu.h"

#define DEBUG_WITH_OSC

void gpio_reset(void) {
    reset_component(RESET_PADS_BANK0, RESET_PADS_BANK0);
    reset_component(RESET_IO_BANK0, RESET_IO_BANK0);
}

void enable_irq(uint32_t irq_no) {
    uint32_t index = irq_no / 16;
    uint32_t mask = 1u << (irq_no % 16);
    __asm__ volatile (
        "csrs 0xbe0, %0\n"
        : : "r" (index | (mask << 16))
    );
}

void force_interrupt(uint32_t irq_no) {
    uint32_t index = irq_no / 16;
    uint32_t mask = 1u << (irq_no % 16);
    __asm__ volatile (
        "csrs 0xbe2, %0\n"
        : : "r" (index | (mask << 16))
    );
}

void cpu_init(void) {
    riscv_init();

    /* Reset GPIO state */
    gpio_reset();

    /* Reset clock to default state */
    clock_reset();

    /* initialize the CPU clock */
    cpu_clock_init();

    /* initialize the early peripherals */
    early_init();

    /* trigger static peripheral initialization */
    periph_init();

    /* initialize the board */
    board_init();
}

/** @} */
